{
	"pools": [
		{
			"rolls": 5,
			"entries": [
				{
					"type": "item",
					"name": "written_book",
					"weight": 1,
					"functions": [
						{
							"function": "set_book_contents",
							"author": "Herobrine011840",
							"title": "Enhanced Depths",
							"pages": [
								"A Guide to the Enhanced Deep Dark Addon 
 
         Blocks: 
 
Darkness Harbinger: 
  A mysterious block found in ancient cities, it will randomly inflict 12 seconds of darkness upon any nearby players. It signifies what is to come... ",
  "Dead Sculk: 
  This version of sculk is no longer living, and as such it does not drop experience like its living counterpart. 
 
Echo Roots: 
  A block found on the ceiling of the Deep Dark biome. It can be grown using Bottles o' enchanting. The bulb version ",
  "of this block is found on the end of the root and can also be grown. 
 
Echo Wall Bush: 
  Found on the sides of the deep dark biome, this block can be used as a stick source in the deep dark and can be regrown. 
 
Pressurized Deepstone: 
  Decorative stone ",
  "found in the deep dark that can be crafted into polished, brick, and slab versions. It makes up ancient cities, too. 
 
Resonance Lights: 
  A small little protrusion of sculk found in sculk patches. If any living thing steps on it, it will disappear and ",
  "damage the attacker slightly. 
 
Soul Magma Block: 
  The deep dark version of a magma block, it does twice the damage and is found all throughout the biome. 
 
Wardenstone: 
  Rare stone found only near the ancient cities that can be chiseled. ",
  "It is merely a decorative block. 
 
Whispering Shrub: 
  Creepy plants found in sculk patches that will whisper if stepped on. 
 
Sonic Sentry: 
  Ancient statues found in ancient cities that will blast you if attacked. Drops 0-2 Echo Shards, ",
  "along with a Chiseled Wardenstone. 
 
 Version 1.1.0 Additions 
 
Climbing Undergrowth: 
  A plant found in the deep dark that grows on the floor. It has no block collision, so entities can walk through it. ",
  "Echo Dust: 
  A crafting ingredient made from echo shards and diamonds. It is used to make echo lamps. 
 
Echoing Flower: 
  Uncommon plants found in the deep dark. they can be grown using bottle o' enchanting to get a seed. The flower will suck the nutrients ",
  "out of the sculk block it is on when it grows. 
 
Echo Lamp: 
  Found in ancient cities or crafted, this lamp will only activate when a sculk sensor or sculk shrieker is placed on it. 
 
Resonance Bell: 
  A rare block found in ancient cities. Its ring scares ",
  "off nearby wardens. It can only be rung every two minutes. 
 
 Version 1.2.0 Additions 
 
Echo Sensor: 
  A variant of the reverberating reactor that will send an echo energy signal to a resonance chamber beneath it when stepped on. ",
  "Heartbeater: 
  A block that will inflict nearby players with darkness when powered by a resonance chamber on the sides or top of it. 
 
Lost Tome: 
  Books found on the paths of the ancient cities that, when broken, yield a book, which may be enchanted. ",
  "Resonance Chamber: 
  The main component in echo electronics, which carries a signal from reverberating reactors or echo sensors and relays it to nearby recievers. 
 
Resonance Pulse Lamp: 
  A lamp that lights up for 5 seconds if given a signal. the long ",
  "variant can stay on for 60 seconds. 
 
Reverberating Reactor: 
  The power source of all echo electronics. It will activate if a sculk sensor recieves a signal when placed atop this block. 
 
Silence Bloom: 
  A very rare sculk flower that can be ",
  "obtained only as a 2% chance of growing from echoing flower crops. 
 
Soul Sucker: 
  A block that can recieve echo power signals to deal 2 damage to any nearby entities. ",
  " Version 1.3.0 Additions 
 
Delay Resonance Chamber: 
  A variant of the resonance chamber crafted using a stone button, a resonance chamber, and a piece of hollowed stone, it can be used to delay an echo signal by 1-1.5 seconds. useful for timing circuits. ",
  "Echo Glass: 
  Useful decorative blocks that send signals from resonance chamber to resonance chamber quickly. they can be found in ancient cities. 
 
Hollowed Stone: 
  A rare block found near water sources and in ancient city ice boxes used for making ",
  "delay resonance chambers and vibration forcefields. 
 
Lost Scuttler: 
  A small beetle found infesting some of the pressurized deepstone bricks in an ancient city. it has no drop and is of moderate danger. 
 
Submerged Gloom: 
  A water plant found in ",
  "the deep dark. it can be used as a decorative light source and can be grown using bottles o' enchanting. 
 
Vibration Forcefield: 
  Useful echo electronic blocks that make an impassable barrier when activated. 
 
Wardenstone Tiles: 
  A decorative variant ",
  "of wardenstone that is crafted or found in ancient city centers. 
 
Suspicious Gravel In Ancient Cities: 
  In this addon, suspicious gravel is found throughout ancient cities, and will have specific loot in certain areas. ",
  "Generic Loot: Anywhere. 
Rare Loot: In the wardenstone tile room of the center. 
Large Ruin Loot: In the barracks or sauna structures. 
Ice Box Loot: In Ice Boxes. 
Sauna Loot: Near the raised pool in saunas. 
Tower Loot: In the less damaged Towers. ",
"Entrance Loot: At the entrance. 
Portal Top Loot: Atop the portal. 
  There is also rare and legendary loot chests, alongside rare ice box chests. ",
  " Version 1.4.0 Additions 
 
Color Changing Resonance Pulse Lamp: 
  This is a variant of the resonance pulse lamp that changes colors and can be crafted with 7 dye, an amethyst shard, and a resonance pulse lamp. 
 
Echo Crystal Block: 
  Crafted with echo ",
  "shards and dust, these blocks are used for the altar used to craft the sculk prism item. 
 
Echo Shrieker: 
  An electronic variant of a sculk shrieker, it gives off a shriek when powered. There is a darkness variant crafted with a sculk prism. ",
  "Experience Multiplier: 
  An electronic block made with a sculk prism, it multiplies xp drops from bottles o' enchanting when powered. 
 
Prism Platform: 
  A block crafted with a sculk prism that makes a platform when powered. ",
  "Sculk Prism: 
  A rare item that is used in high tier echo electronics. The way to craft this is make an altar. The altar is made by placing a 5x5 platform of cobbled deepslate, then put 4 wardenstone in the corners atop the platform, and finally put an ",
  "echo crystal block and a darkness harbinger in the middle. 
 
Tendril Roots: 
  Plants found in the deep dark that emit a small level of light. they can be grown with bottles o' enchanting. 
 
Toggle Resonance Pulse Lamp: 
  A lamp that can be ",
  "toggled with the input of echo signals. 
 
 Version 1.5.0 Additions 
 
Broken Echo Electronics: 
  These blocks can be found in echo ruins and can be repaired using materials used to make the machines. ",
  "Echo Ruins: 
  Rare structures found on or slighly below the overworld's surface that contain suspicious gravel and broken echo electronics. they are found in hillier biomes like deserts and savannas. ",
  "Echo Shard Crafting Template: 
  A rare item found in echo ruins that can be used to craft echo shards. costs diamonds and wardenstone to duplicate. 
 
 Version 1.6.0 Additions 
 
Deepslate Sigils: 
  Rare items found in ancient cities and echo ",
  "ruins that are decorative and can be duplicated. 
 
Sonic Bloom: 
  A rare plant that serves as a decorative block. it may produce particles occasionally and has a 2% chance of growing from echoing flower seeds. "
							]
						}
					]
				}
			]
		},
		{
			"rolls": 1,
			"entries": [
				{
					"type": "item",
					"name": "minecraft:stone_axe",
					"weight": 1
				},
				{
					"type": "item",
					"name": "minecraft:wooden_axe",
					"weight": 3
				}
			]
		},
		{
			"rolls": 1,
			"entries": [
				{
					"type": "item",
					"name": "minecraft:stone_pickaxe",
					"weight": 1
				},
				{
					"type": "item",
					"name": "minecraft:wooden_pickaxe",
					"weight": 3
				}
			]
		},
		{
			"rolls": 1,
			"entries": [
				{
					"type": "item",
					"name": "minecraft:bread",
					"weight": 1,
					"functions": [
						{
							"function": "minecraft:set_count",
							"count": {
								"min": 1,
								"max": 2
							}
						}
					]
				}
			]
		},
		{
			"rolls": 1,
			"entries": [
				{
					"type": "item",
					"name": "minecraft:stick",
					"weight": 1,
					"functions": [
						{
							"function": "minecraft:set_count",
							"count": {
								"min": 1,
								"max": 12
							}
						}
					]
				}
			]
		},
		{
			"rolls": 1,
			"entries": [
				{
					"type": "item",
					"name": "minecraft:sculk",
					"weight": 1
				},
				{
					"type": "item",
					"name": "dd:deepstone",
					"weight": 1
				}
			]
		}
	]
}